Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: As he was an honest man, I employed him.
hi: वह ईमानदार इनसान था, इसलिए मैंने उसे नौकरी पर रख लिया।

source: To tell the truth, I felt lonely.
hi: सच कहूं तो मुझे अकेलापन महसूस हुआ।

source: Honesty is the best policy.
hi: ईमानदारी सर्वोत्तम नीति है।

source: All the students look up to him.
hi: सारे विद्यार्थी उसका आदर-सम्मान करते थे।

source: Read it aloud.
hi: पढ़के सुनाओ।

source: Be quiet. Don't talk in class.
hi: शांत रहो। कक्षा के दौरान बात मत करो।

source: Keep quiet.
hi: छुप रह।

source: Where would you like to sit?
hi: आप कहाँ बैठना चाहेंगे?

source: When I was a kid, touching bugs didn't bother me a bit. Now I can hardly stand looking at pictures of them.
hi: जब मैं बच्चा था, मुझे कीड़ों को छूने से कोई परेशानी नहीं होती थी, पर अब मैं उनकी तस्वीरें देखना भी बर्दाश्त नहीं कर सकता।

source: She used to be a very shy girl.
hi: वह बहुत शर्मीली लड़की हुआ करती थी।

source: Once upon a time, there lived a great king in Greece.
hi: एक बार की बात है, यूनान में एक महान राजा रहता था।

source: Kill two birds with one stone.
hi: एक तीर से दो शिकार।

source: Don't throw stones.
hi: पत्थर मत फेंको।

source: They substituted coal for oil.
hi: उन्होंने कोयले के बजाय तेल का इस्तेमाल किया।

source: Petrol is no longer a cheap fuel.
hi: ईंधनों में पेट्रोल भी अब सस्ता नहीं रहा।

source: The baby has been crying for a long time.
hi: बच्चा बहुत देर से रो रहा था।

source: You shouldn't leave the baby alone.
hi: तुम्हे बच्चे को अकेला नहीं छोड़ना चाहिए।

source: Hold the baby gently.
hi: बच्चे को धीरे से पकड़ो।

source: The baby ceased crying.
hi: बच्चे ने रोना समाप्त कर दिया।

source: I have to put the baby to bed.
hi: मुझे बच्चे को सुलाना है।

source: Have you got a red pencil?
hi: तुम्हारे पास लाल पेनसिल है क्या?

source: The equator divides the globe into two hemispheres.
hi: भूमध्य रेखा पृथ्वी को दो गोलार्धों में बांटती है।

source: Ticket, please.
hi: टिकट, कृप्या।

source: It looks like snow.
hi: बरफ़ जैसा दिखता है।

source: There is no doubt.
hi: इसमें कोई शक नहीं है।

source: We didn't have much rain last month.
hi: पिछले महीने ज़्यादा बारिश नहीं हुई।

source: Last week five students were absent from class.
hi: पिछले हफ़्ते क्लास से पाँच विद्यार्थी अनुपस्थित थे।

source: It has been fine since last Friday.
hi: पिछले शनिवार से मौसम बहुत अच्छा है।

source: He was sick last week.
hi: वह पिछले हफ़्ते बीमार था।

source: Rabbi, you are the Son of God; you are the King of Israel.
hi: रब्बी, तुम ईश्वर के बेटे हो; तुम इज़राइल के राजा हो।

source: Thank you very much, doctor.
hi: डॉक्टर साहब, आपका बहुत बहुत धन्यवाद।

source: Not all teachers behave like that.
hi: सभी शिक्षक वैसा बर्ताव नहीं करते।

source: The teacher was disappointed at my answer.
hi: टीचर मेरा जवाब सुनकर निराश थीं।

source: Thank you for the other day.
hi: उस दिन के लिए बहुत बहुत धन्यवाद।

source: The other day her mother passed away in the hospital.
hi: कुछ दिन पहले उसकी माँ हस्पताल में चल बसीं।

source: The reason for declaring war is not certain.
hi: जंग के ऐलान का कारण साफ़ नहीं है।

source: War arouses the animal in man.
hi: जंग इनसान के अंदर का जानवर जगा देती है।

source: The war is going in our favor.
hi: जंग हमारे हित में जा रहा है।

source: There's a possibility of war.
hi: युद्ध की संभावना है।

source: The war wasted the country.
hi: जंग ने देश को नष्ट कर डाला।

source: I feel sad when I think about all the people who die in wars.
hi: मुझे दुख होता है जब मैं उन लोगों की सोचता हों जो जंग में अपनी जान खो देते हैं।

source: During the war, we had to do without sugar.
hi: जंग के समय में हमे चीनी के बिना ही काम चलाना पड़ा।

source: Looking at the pile of laundry, I sighed.
hi: धुलने वाले कपड़ों के ढेर को देखकर आँही भरी।

source: Traveling by boat takes longer than going by car.
hi: नाव के सफ़र में कार से ज्यादा समय लगता है.

source: The ship set sail for Bombay.
hi: जहाज़ बमबई के लिए रवाना हुआ।

source: The ship set sail only to be wrecked two days after.
hi: जहाज़ पाल तानने के दो दिन बाद पोत-भंग हो गया।

source: How many people are on board the ship?
hi: जहाज़ में कितने लोग हैं?

source: To distinguish right from wrong is difficult.
hi: सही और ग़लत में अंतर करना मुश्किल होता है।

source: Certainly.
hi: निश्चित.

source: All the world is divided into three types of people - finger-users, chopstick-users, and fork-users.
hi: सारी दुनिया में केवल तीन तरह के लोग हैं - ऊँगलीयाँ, चॉपस्टिक्स और फ़ोर्क इसतेमाल करने वाले।

source: My grandmother speaks slowly.
hi: मेरी नानी धीरे-धीरे बोलतीं हैं।

source: It was her fate to die young.
hi: छोटी उम्र में मरना उसके भाग्य में था।

source: Come home early.
hi: जल्दी घर आजाओ।

source: Come quick!
hi: जल्दी आओ!

source: Early rising is good for the health.
hi: सुबह जल्दी उठना सेहत के लिए अच्छा होता है।

source: He keeps on talking forever if you listen to him.
hi: तुम उसकी बात सुनते रहो तो वह बात करता ही जाएगा।

source: You are at it again.
hi: तुम फिरसे चालू हो गए।

source: They charged me for the broken window.
hi: उन्होंने ने मुझसे टूटी हुई खिड़की के लिए पैसे माँगे।

source: What do you call a man who takes care of sheep in the field?
hi: खेत में बकरियों की देखभाल करने वाले आदमी को क्या बुलाया जाता है?

source: Thank you for the present.
hi: तोहफ़े के लिए धन्यवाद।

source: He will commit suicide if he can't see his son.
hi: वह अपने बेटे को नहीं देख पाया तो वह आत्महत्या कर लेगा।

source: Wash your feet.
hi: अपने पैर धोओ।

source: The villagers regarded the stranger as their enemy.
hi: गांववालें अजनबी को अपना दुश्मन मानते थे।

source: Is there anything I can do for you now?
hi: क्या मैं अभी आप के लिए कुछ कर सकता हूं?

source: Keeping what belongs to another amounts to stealing.
hi: दूसरे की चीज़ को अपने पास रखना चोरी के समान है।

source: Many words are pronounced according to the spelling, but some are not.
hi: बहुत सारे शब्दों को उनकी वर्तनी के हिसाब से पढ़ा जाता है, पर कुछ शब्दों को ऐसे नहीं पढ़ा जाता है।

source: A lot of countries participated in the Olympic Games.
hi: बहुत सारे देशों ने ओलिंपिक खेलों में हिस्सा लिया।

source: The sun came out.
hi: सूरज बाहर आया।

source: The sun is much larger than the moon.
hi: सूरज चांद से बहुत ज़्यादा बड़ा है।

source: The batter was out.
hi: बॅटर आऊट हो गया था।

source: My whole body feels heavy.
hi: मेरा पूरा शरीर भारी सा लगता है।

source: It's not healthy for you.
hi: यह तुम्हारी सेहत के लिए अच्छा नहीं है।

source: While I was in Taiwan, I made friends with him.
hi: मैं जब ताईवान में था तब उसके साथ दोस्त बन गया।

source: A big dog is always beside him.
hi: उसके साथ हमेशा एक बड़ा सा कुत्ता रहता है।

source: The heavy rain brought the flood, causing damage.
hi: भारी बारिश के साथ बाढ़ भी आई और उसने बहुत नुकसान पहुँचाया।

source: What are you going to do in college?
hi: तुम कॉलेज जाकर क्या करोगे?

source: It was raining heavily in Osaka.
hi: ओसाका में भारी बारिश हो रही थी।

source: He lives in Osaka.
hi: वह ओसाका में रहता है।

source: That is almost correct.
hi: यह लगभग सही है।

source: The President is to make a statement tomorrow.
hi: राष्ट्रपति कल बयान देने वालें हैं।

source: It was very hot.
hi: बहुत गरम था।

source: Tell me the name of the ninth month.
hi: मुझे नौवे महीने का नाम बताओ।

source: Let's fly kites.
hi: चलो पतंग उड़ाएँ!

source: A river runs down through the valley.
hi: वादी में से एक नदी बहती है।

source: Is anybody here?
hi: कोई है क्या?

source: Someone knocked on the door.
hi: किसी ने दरवाज़े पर खटखटाया।

source: I heard someone knocking.
hi: मुझे किसी के खटखटाने की आवाज़ सुनाई दी।

source: I heard someone call my name from behind.
hi: मैंने किसी को पीछे से मेरे नाम पुकारते हुए सुना।

source: Someone robbed Mary of her money.
hi: किसी ने मेरी से उसके पैसे चुरा लिए।

source: Who made this cake?
hi: यह केक किसने बनाया है?

source: Who made this pie?
hi: यह पाय किसने बनाई है?

source: Who wrote this letter?
hi: यह पत्र किसने लिखा?

source: Do you know who wrote this novel?
hi: जानते हो यह उपन्यास किसने लिखा है?

source: Who is in this room?
hi: इस कमरे में कौन है?

source: Who's at the wheel?
hi: गाड़ी कौन चला रहा है?

source: Who wrote a letter?
hi: चिट्ठी किसने लिखी?

source: Who do you think broke the window?
hi: तुम्हें क्या लगता है? खिड़की किसने तोड़ी है?

source: I do not like wearing anybody else's clothes.
hi: मुझे किसी और के कपड़े पहनना अच्छा नहीं लगता।

source: Who knows?
hi: कौन जाने?

source: Who helps her?
hi: उसकी मदद कौन करता है?

source: Everybody wants to live in comfort.
hi: सभी लोग आराम की ज़िन्दगी जीना चाहते हैं।

source: Who is to blame for the accident?
hi: इस दुर्घटना के लिए कौन ज़िम्मेदार है?

source: Everyone knew the song.
hi: वह गाना सभी को पता था।

source: Nobody can escape death.
hi: मौत से कोई नहीं बच सकता है।

source: Everyone has a right to enjoy his liberty.
hi: हर किसी को अपनी स्वतंत्रता का उपयोग करने का अधिकार होता है।

source: Everyone speaks well of him.
hi: सभी उसकी अच्छाई करते है।

source: No one can move the big box.
hi: उस बड़े डब्बे को कोई भी नहीं हिला सकता।

source: Nobody answered my question.
hi: किसी ने भी मेरे सवाल का जवाब नहीं दिया।

source: Who are you laughing at?
hi: तुम किस पर हस रे हो?

source: You'll get a lot of presents on your birthday.
hi: तुम्हें अपने जन्मदिन पर बहुत सारे तोहफ़े मिलेंगे।

source: How was your birthday?
hi: जन्मदिन कैसा था?

source: The men went hunting for lions.
hi: वे आदमी शेरों का शिकार करने निकले।

source: Boys will be boys.
hi: लड़के तो लड़के ही रहेंगे।

source: Every man should learn how to cook.
hi: हर आदमी को खाना बनाना सीखना चाहिए।

source: It's too expensive.
hi: बहुत महंगा है!

source: Wisdom cannot come without experience.
hi: बुद्धी तज़ुर्बे के बिना नहीं आती।

source: No one can deny the fact that the earth is round.
hi: पृथ्वी गोल है इस सचाई को कोई भी अस्वीकार नहीं कर सकता।

source: Three-fourths of the earth's surface is water.
hi: धरती का तीन-चौथाई भाग पानी है.

source: The earth rotates.
hi: पृथ्वी घूमती है।

source: The earth moves around the sun.
hi: धरती सूरज की परिक्रमा करती है।

source: The Earth, Mars and Jupiter are planets.
hi: पृथ्वी, मंगल और बृहस्पति ग्रह हैं।

source: When an earthquake occurs, what will you do first?
hi: भूकम्प आने पर तुम सबसे पहले क्या करोगे?

source: Please pardon me for coming late.
hi: मुझे देर से आने के लिए माफ़ कीजिएगा।

source: Tea is widely grown in India.
hi: चाय भारत में बहुत उगाई जाती है।

source: The population of China is larger than that of India.
hi: चीन की जनसंख्या भारत की से बड़ी है।

source: China is the largest country in Asia.
hi: एशिया में सबसे बड़ा देश चीन है।

source: China is much larger than Japan.
hi: चीन जापान से काफ़ी ज़्यादा बड़ा है।

source: Can you count to ten in Chinese?
hi: क्या आप चीनी भाषा में दस तक गिनती कर सकते हैं?

source: The decayed tooth came out on its own.
hi: गला हुआ दांत स्वयं निकल आया है.

source: What would you like for breakfast?
hi: सुबह के नाश्ते में आप क्या लेना पसंद करेंगे?

source: What time will you have breakfast?
hi: तुम नाश्ता कितने बजे लोगे?

source: We shall start after breakfast.
hi: हम नाश्ता खाकर निकलेंगे।

source: I spent my time strolling about the streets.
hi: मैंने सड़कों की सैर कर के समय व्यतीत किया.

source: I felt hungry after the long walk.
hi: मुझे लम्बी सैर के बाद भूख लग आई।

source: I found the cage empty.
hi: मुझे पिंजरा खाली मिला।

source: Birds sing.
hi: पंछी गाते हैं।

source: Birds build nests.
hi: पक्षी घोसले बनातें हैं।

source: Birds fly.
hi: पंछी उड़ते हैं।

source: Naoko swims.
hi: नाओको तैरती है।

source: You must endure the pain.
hi: तुम्हें दर्द सहना ही पड़ेगा।

source: He deliberately ignored me when I passed him in the street.
hi: जब मैं सड़क पर उसके सामने से गया, उसने जानबूझकर मुझे पहचाना नहीं।

source: There is a church across the street.
hi: सड़क के सामने एक चर्च है।

source: There are a lot of flowers in the garden.
hi: बगीचे में बहुत सारे फूल हैं।

source: All the flowers in the garden died for lack of water.
hi: बाग के सारे फूल पानी की कमी की वजह से मर गए।

source: My little brother can read English.
hi: मेरे छोटे भाई को अंग्रेज़ी पढ़ने आती है।

source: My brother depends on me for money.
hi: मेरा भाई पैसों के लिए मुझपर निर्भर है।

source: The thief cursed the police for finding him.
hi: चोर ने पुलिस को उसको पकड़ने के लिए गाली दी।

source: The thieves pulled open all the drawers of the desk in search of money.
hi: चोरों ने पैसे ढूँढने के लिए मेज़ की सारी दराज़ें खोल डालीं।

source: The thief is certain to be caught eventually.
hi: चोर अंत में तो पकड़ा ही जाएगा।

source: I worked all night.
hi: मैंने पूरी रात काम किया।

source: Iron is harder than gold.
hi: लोहा सोने से सख्त होता है।

source: A new means of communication was developed — the railway.
hi: संचार के एक नए माध्यम का विस्तार हुआ - रेल।

source: You might as well read a novel instead of staring at the ceiling.
hi: छत पर घूरने के बजाए उपन्यास ही पढ़लो।

source: The weather varies quite often.
hi: मौसम अक्सर बदलता है।

source: Astronomy is by no means a new science.
hi: खगोल विद्या किसी भी तरह से नई विद्या नहीं है।

source: Do you like to live in the country?
hi: आप को गाँव में रहना पसंद है क्या?

source: Mr Tanaka is our teacher of English.
hi: तानाका जी हमारे अंग्रेज़ी के शिक्षक हैं।

source: The light doesn't work.
hi: यह बत्ती काम नहीं करती।

source: Let's take a train.
hi: रेलगाड़ी से चलते हैं।

source: You are on the wrong train.
hi: आप गलत ट्रेन पर हैं।

source: Please answer me by telegram.
hi: कृपया टेलीग्राम से उत्तर दीजिए।

source: The telephone rang several times.
hi: फ़ोन कई बार बजा।

source: I'll make a phone call.
hi: मैं फ़ोन करता हूँ।

source: I feel like throwing up.
hi: मुझे उल्टी आ रही है।

source: They sell land by the acre.
hi: वे ज़मीन एकड़ों में बेचतें हैं।

source: I till the earth.
hi: मैं हल चलाता हूँ।

source: Saturday is the last day of the week.
hi: शनिवार हफ़्ते का आखिरी दिन होता है।

source: Don't shout.
hi: चिल्लाओ मत!

source: With winter coming on, it's time to buy warm clothes.
hi: सर्दियाँ आ रहीं हैं, हमें गरम कपड़े खरीदने चाहिएँ।

source: Winter is coming on.
hi: सर्दी आ रही है।

source: With the coming of winter, days are getting shorter.
hi: सर्दोयों के आने से दिन छोटे होते जाते हैं।

source: In winter our lips get chapped.
hi: सर्दियों में हमारे होठ फट जातें हैं।

source: Wear warm clothes in winter.
hi: सर्दियों में गरम कपड़े पहनो।

source: Do you live in Tokyo?
hi: तुम टोक्यो में रहते हो क्या?

source: I live in Tokyo.
hi: मैं टोक्यो में रहता हूँ।

source: Tokyo is a very big city.
hi: टोक्यो बहुत बड़ा शहर है।

source: Toudaiji is the bigger of the two temples.
hi: उन दो मंदिरों में तोदाइजी बड़ा वाला है।

source: The lights have been burning all night.
hi: बत्तियाँ पूरी रात से जल रहीं हैं।

source: Obviously.
hi: स्पष्ट रूप से.

source: The authorities have been hiding the facts from the public.
hi: अधिकारियों ने सच्चाई को आम जनता से छिपा कर रखा हुआ है।

source: In those days it was far from easy to come by a good job.
hi: उन दिनों में अच्छी नौकरी ढूँढना बहुत मुश्किल हुआ करता था।

source: Travelling was much more difficult in those days.
hi: उन दिनों में सफ़र करना बहुत मुश्किल हुआ करता था।

source: Our main office is in Osaka.
hi: हमारा मुख्य कार्यालय ओसाका में है।

source: Naturally.
hi: स्वभाविक रूप से.

source: Duck!
hi: झुको!

source: I stayed at home all day instead of going to work.
hi: मैं काम पर जाने के बजाय सारे दिन घर पर रहा।

source: I can't move.
hi: मैं हिल नहीं सकता।

source: We all stood up at once.
hi: हम सब एक-साथ खड़े हो गए।

source: I found little amusement in reading.
hi: मुझे किताबें पढ़ने से बिलकुल भी आनन्द नहीं आता था।

source: Where is the south terminal?
hi: दक्षिण टर्मिनल कहाँ पर है?

source: Know thyself.
hi: अपने आप को जानो।

source: Which is the more expensive of the two?
hi: इन दोनो में से ज़्यादा महंगा कौनसा है?

source: Two crows are flying in the sky.
hi: आसमान में दो कौवे उड़ रहें हैं।

source: Two brothers set out on a journey together.
hi: दो भाई एक-साथ सफ़र पर निकले।

source: The two brothers smiled at each other.
hi: दोनों भाई एक दूसरे पर मुस्कुराये.

source: Two boys came running out of the room.
hi: दो लड़के कमरे से भागे निकल आए।

source: The two tried one after the other.
hi: दोनो ने एक-एक करके कोशिश करी।

source: They hated each other.
hi: वे एक-दूसरे से नफ़रत करते थे।

source: How many colors do you see in the rainbow?
hi: इन्द्रधनुष में तुम्हें कितने रंग दिखाई देते हैं?

source: By the time the sun sets, we will arrive at the destination.
hi: हम सूरज के डूबने से पहले अपनी मंजिल तक पहुँच जाएँगे।

source: Japanese flags were flying.
hi: जापानी झंडे लहरा रहे थे।

source: Let's take a rest in the shade.
hi: चलो छाया में थोड़ा आराम करलें।

source: The date has been appointed but the place has not.
hi: तारीख चुन ली गई है पर जगह नहीं।

source: In Japan people take off their shoes when they enter a house.
hi: जापान में घर के अंदर जाने के समय जूते उतारे जाते हैं।

source: In Japan, all children go to school.
hi: जापान में सभी बच्चें स्कूल जाते हैं।

source: In Japan a new school year starts in April.
hi: जापान में स्कूल अप्रैल में शुरू होता है।

source: It is expensive to live in Japan.
hi: जापान में रहना बहुत महंगा है।

source: Which is larger, Japan or Britain?
hi: ज़्यादा बड़ा क्या है, जापान या ब्रिटेन?

source: The Japanese national power is still developing.
hi: जापानी राष्ट्रीय शक्ती अभी भी विकसित हो रही है।

source: Japan is not what it was ten years ago.
hi: जापान दस साल पहले जैसे था वैसा अब नहीं रहा।

source: Japan is an industrial nation.
hi: जापान एक औद्योगिक राष्ट्र है।

source: Japan is an industrial country.
hi: जापान एक औद्योगिक देश है।

source: Japan is one of the greatest economic powers in the world.
hi: जापान दुनिया के सबसे ताकतशाली अर्थतंत्रों में से एक है।

source: Japan depends on other countries for oil.
hi: जापान तेल के लिए दूसरे देशों पर निर्भर है।

source: Japan imports a large quantity of oil.
hi: जापान बड़ी तादाद में तेल आयात करता है।

source: Japan is a beautiful country.
hi: जापान सुंदर देश है।

source: Welcome to Japan.
hi: जापान में आपका स्वागत है।

source: The Japanese eat more beef than the British do.
hi: जपानी ब्रिटिशों से ज़्यादा गोमांस खाते हैं।

source: The Japanese eat rice at least once a day.
hi: जापानी दिन में कम-से-कम एक बार चावल खाते है।

source: The Japanese have dark eyes.
hi: जापानियों की आँखें कालीं होतीं हैं।

source: The Japanese government made an important decision.
hi: जपानी सरकार ने एक महत्त्वपूर्ण निर्णय लिया।

source: Is it open on Sunday?
hi: रविवार को खुला होता है क्या?

source: I'm not always home on Sundays.
hi: में रविबार को हमेषा घर पे नहीं होता.

source: Sunday is the last day of the week.
hi: रविवार सप्ताह का अंतिम दिन होता है।

source: We abbreviate Sunday to Sun.
hi: हम रविवार को संक्षिप्त करके रवि लिखते हैं।

source: We are supposed to take off our shoes at the entrance.
hi: हमे अंदर जाने से पहले जूते उतारने होंगे।

source: Do I have to stay in the hospital?
hi: क्या मुझे अस्पताल में रहना होगा?

source: A cat ran after a mouse.
hi: एक बिल्ली चूहे के पीछे भागी।

source: Some people like cats, others prefer dogs.
hi: कुछ लोगों को बिल्लियाँ अच्छी लगतीं हैं, कुछ लोगों को कुत्ते।

source: Cats like playing in the sun.
hi: बिल्लियों को धूप में खेलना अच्छा लगता है।

source: I have a fever.
hi: मुझे बुख़ार है।

source: The older you are, the more difficult it is to learn a language.
hi: तुम्हारी उम्र जितनी बड़ी होती है, तुम्हारे लिए कोई भाषा सीखना उतना ही कठिन होता है।

source: Years passed.
hi: साल बीते।

source: From year to year they were growing poorer.
hi: वे हर साल और ज़्यादा गरीब हुए जा रहे थे।

source: The horse is a useful animal.
hi: घोड़ा बड़े काम का जानवर है।

source: Nonsense!
hi: बकवास!

source: Don't have me on!
hi: मुझे मूर्ख मत समझना!

source: It is up to you whether to buy it or not.
hi: ख़रीदो या न ख़रीदो तुम्हारे ऊपर है।

source: There are no live animals in the museum.
hi: म्युज़ियम में ज़िन्दा जानवर नहीं हैं।

source: Some of the apples in the box were rotten.
hi: डब्बे में कुछ सेव सड़े हुए थे।

source: There is a doll in the box.
hi: बक्से में एक गुड़िया है।

source: The growth in population is very rapid in developing countries.
hi: विकासशील देशों में जनसंख्या वृद्धी बहुत तीव्र होती है।

source: I saw a girl whose hair came down to her waist.
hi: मैंने एक लड़की को देखा जिसके बाल उसकी कमर तक आते थे।

source: He can't be under thirty.
hi: वह कम-से-कम तीस साल का तो होगा।

source: He has every reason for getting angry with you.
hi: उसके पास तुमसे नाराज़ होने का पूरा हक है।

source: He made such a long speech that we all got bored.
hi: उसने इतना लम्बा भाषण दिया कि हम सब को बोर कर डाला।

source: It is definite that he will go to America.
hi: कि वह अम्रीका जाएगा, यह तो पक्का है।

source: I expect him to come.
hi: मुझे लगता है वह आएगा।

source: I wonder where to hang the picture he gave me.
hi: सोच रही हूँ उसकी दी हुई तस्वीर को कहाँ टाँगा जाए।

source: What he did was nothing less than madness.
hi: उसने जो किया वह पागलपन से कुछ कम नहीं था।

source: He cannot have done such a thing.
hi: वह ऐसी चीज़ कर ही नहीं सकता।

source: Nobody could tell what he meant by that.
hi: कोई नहीं बता सका उसका वह कहने से मतलब क्या था।

source: When he would not give them higher pay, they went on strike.
hi: जब उसने उनके वेतन बढ़ाने से इनकार कर दिया, उन्होंने हड़ताल कर दी।

source: I have no idea how he escaped.
hi: मुझे नहीं पता वह कैसे निकल भागा।

source: He won the race again.
hi: उसने प्रतियोगिता फिरसे जीत ली।

source: Do you know what he has done?
hi: क्या आपको पता है उसने क्या किया है?

source: His absence was due to illness.
hi: वह बीमारी की वजह से नहीं आ सका।

source: The box he found was empty.
hi: उसे जो डब्बा मिला वह खाली था।

source: The dog followed him wherever he went.
hi: वह जहाँ भी जाए, वह कुत्ता उसके पीछे-पीछे जाता था।

source: He came to see you yesterday.
hi: वह कल तुमसे मिलने आया था।

source: It doesn't matter whether he agrees or not.
hi: वह माने या न माने उससे कुछ फ़र्क नहीं पड़ता।

source: I heard him go out.
hi: मैंने उसके बाहर जाने की आवाज़ सुनी।

source: I am proud of his honesty.
hi: मुझे उसकी ईमानदारी पर नाज़ है।

source: I saw him running.
hi: मैंने उसे दौड़ते हुए देखा।

source: He did the work on his own.
hi: उसने काम अपने-आप किया।

source: I was surprised at his sudden appearance.
hi: मैं उसके अचानक से आ जाने पर चौंक गया था।

source: The picture painted by him is of great value.
hi: यह तसवीर जो उन्होंने पेंट करी है बहुत क़ीमती है।

source: He can't be ill.
hi: वह बीमार नहीं हो सकता।

source: I'm anxious for him to return safe.
hi: मैं उसके सुरक्षित लौटने के लिए बेचैन हूँ।

source: No one believes that he is innocent.
hi: किसी को भी उसके निर्दोष होने का यकीन नहीं है।

source: The reason which he gave is hard to understand.
hi: उसके दिए गए कारण को समझना मुश्किल है।

source: I was taking a bath when he came.
hi: जब वह आया मैं नहा रहा था।

source: I will get through with my homework before he comes.
hi: मैं उसके आने से पहले अपना होमवर्क खतम कर लूँगा।

source: His disappointment was obvious to everyone.
hi: उसकी निराशा सभी आसानी से दिख सकते थे।

source: I haven't met him.
hi: मेरी उससे मुलाकात नहीं हुई है।

source: It's no use arguing with him.
hi: उससे बहस करने में कोई फ़ायदा नहीं है।

source: I asked him to do that.
hi: मैंने उससे वह करने को कहा था।

source: I managed to make him understand it.
hi: में उसे समझा पाया.

source: I'd rather not meet him.
hi: हो सके तो मैं उससे मिलना नहीं चाहूँगा।

source: I doubt his ability to do the job.
hi: मुझे उसके काम करने की योग्यता पर भरोसा नहीं है।

source: He couldn't understand the sentence.
hi: उसको वाक्य समझ में नहीं आया।

source: He made a careless mistake, as is often the case with him.
hi: उसने हमेशा की तरह लापरवाही में ग़लती की।

source: I have not seen him in months.
hi: मैंने उसे महीनों से नहीं देखा है।

source: He has two brothers, one lives in Osaka and the other in Kobe.
hi: उसके दो भाई हैं, एक ओसाका में रहता है और दूसरा कोबे में।

source: He is possessed of intelligence.
hi: वह अकलमंद है।

source: I'm longing to see him.
hi: मैं उससे मिलने के लिए उत्सुक हूँ।

source: I mentioned your name to him.
hi: मैंने उसके साथ तुम्हारा नाम लिया था।

source: How old might his grandfather be?
hi: उसके नाना की उम्र क्या होनी चाहिए?
